{
  "project_name": "aim-telemetry",
  "description": "AIM XRK telemetry analysis with shift point, lap, and transmission comparison features",
  "features": [
    {
      "id": "uat-001",
      "name": "Execute UAT script for recent features",
      "category": "testing",
      "description": "Manual user acceptance testing of all recent frontend features (arch-001 through arch-006 + feedback widget). Walk through docs/UAT_SCRIPT.md and report results. Covers: vehicle switching, analysis dashboard, audit mode UI (3 pages), G-G diagram, corner analysis, delta track map, feedback widget, error handling, and performance.",
      "status": "planned",
      "priority": 61,
      "depends_on": [],
      "tests": [],
      "files": [
        "docs/UAT_SCRIPT.md"
      ],
      "notes": "UAT script created with 12 sections, ~150 test steps. Estimated time: 30-45 minutes. Focus on audit mode UI (biggest UX change), vehicle switching, and all analysis pages. Not a blocker but required for validation of recent work. User will report back results."
    },
    {
      "id": "uat-010",
      "name": "UAT: Analysis page",
      "category": "uat",
      "description": "Run /uat analysis — trace every interaction on the main analysis dashboard. This is the most complex page: session selector, 5 analysis type buttons (Full Report, Shifts, Laps, Gears, Power), track map rendering, lap table with classification filters, lap comparison with delta map, audit toggle + panel, Chart.js visualizations. Trace each button click through JS → API → router → analyzer → response → DOM rendering. Check error paths (no session selected, missing GPS, server error). Fix any bugs found.",
      "status": "passing",
      "priority": 62,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/analysis.html",
        "src/main/routers/analysis.py",
        "static/js/session_selector.js",
        "static/js/audit.js"
      ],
      "notes": ""
    },
    {
      "id": "uat-011",
      "name": "UAT: G-G diagram page",
      "category": "uat",
      "description": "Run /uat gg-diagram — trace every interaction on the friction circle page. Interactions: session selector, lap filter dropdown (onChange re-fetches), color-by dropdown (speed/throttle/lap), audit toggle, quadrant breakdown cards, mini track map with zone markers, lap comparison overlay. Check: does lap filter actually re-fetch data? Do zone clicks highlight correctly? Does color-by mode change the scatter plot? What happens with no session selected? Fix any bugs found.",
      "status": "passing",
      "priority": 63,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/gg_diagram.html",
        "src/main/routers/visualization.py",
        "src/features/gg_analysis.py"
      ],
      "notes": ""
    },
    {
      "id": "uat-012",
      "name": "UAT: Corner analysis page",
      "category": "uat",
      "description": "Run /uat corner-analysis — trace every interaction on the turn-by-turn analysis page. Interactions: session selector, track map with numbered corner overlays, corner card list (entry/apex/exit speeds, time, throttle), comparison table, speed chart with corner markers, audit toggle + panel. Check: does corner detection produce sane results? Are corner numbers consistent between map and cards? What happens with no GPS data? Fix any bugs found.",
      "status": "passing",
      "priority": 64,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/corner_analysis.html",
        "src/main/routers/visualization.py",
        "src/features/corner_analysis.py"
      ],
      "notes": ""
    },
    {
      "id": "uat-013",
      "name": "UAT: Track map page",
      "category": "uat",
      "description": "Run /uat track-map — trace the GPS track visualization page. Interactions: file/session selector, color-by dropdown (speed/rpm/gear), format options (SVG/HTML/JSON), embedded SVG rendering, legend, zoom/pan behavior. Check: does the SVG render with correct aspect ratio? Does color-by switch work without re-fetching? What happens with missing GPS columns? Fix any bugs found.",
      "status": "passing",
      "priority": 65,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/track_map.html",
        "src/main/routers/visualization.py",
        "src/visualization/track_map.py"
      ],
      "notes": "UAT complete. 2 Critical: standalone track_map.html never rendered (no route), lap selector non-functional (no backend support). 3 Major: no threshold sliders on corner page, format options (HTML/JSON) not exposed in UI, lap selector in orphaned template is dead code. 5 Minor issues."
    },
    {
      "id": "uat-020",
      "name": "UAT: Sessions page",
      "category": "uat",
      "description": "Run /uat sessions — trace every interaction on the session browser. Interactions: filter bar (track dropdown, session type, import status), session table (columns: date, track, vehicle, laps, best time, type, status), row actions (view detail, analyze, edit), import button link, pagination or scrolling. Check: do filters actually call API with correct query params? Do row actions navigate correctly? What does the table show when 0 sessions match filters? Fix any bugs found.",
      "status": "passing",
      "priority": 66,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/sessions.html",
        "src/main/routers/sessions.py"
      ],
      "notes": "UAT complete. 2 Critical: vehicle column shows N/A (API returns vehicle_id not vehicle_name), status filter broken (JS checks session.status but API returns import_status). 3 Minor: no pagination, enum display."
    },
    {
      "id": "uat-021",
      "name": "UAT: Session import wizard",
      "category": "uat",
      "description": "Run /uat session-import — trace the full import wizard flow. Interactions: parquet file picker, track selection (auto-detect or override), vehicle dropdown, session type selector (practice/qualifying/race/test), driver name with autocomplete from /api/v2/drivers/recent, weather and track conditions, tire pressures (4 fields), notes textarea, setup snapshot capture, submit button. Check: does auto-detect actually call the right API? Does autocomplete debounce? Are all fields included in the POST body? What validation exists? What happens on submit failure? Fix any bugs found.",
      "status": "passing",
      "priority": 67,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/session_import.html",
        "src/main/routers/sessions.py"
      ],
      "notes": "UAT complete. 3 Critical: ImportResult missing total_duration/sample_count fields (Step 2 can't show duration), API returns active_vehicle but JS reads active_vehicle_id. 4 Minor: missing modified date column, silent vehicle load failure, setup value type inconsistency, no form revalidation."
    },
    {
      "id": "uat-022",
      "name": "UAT: Session detail page",
      "category": "uat",
      "description": "Run /uat session-detail — trace every interaction on the individual session view. Interactions: session metadata display, stint breakdown, lap table with gap-to-best, lap classification override (PUT /api/v2/sessions/{id}/laps/{lap}/classify), setup comparison (pre/post), confirm session button, edit metadata, navigate to analysis. Check: does lap classify actually call the API? Does confirm update status? Are setup snapshots displayed correctly? Fix any bugs found.",
      "status": "passing",
      "priority": 68,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/session_detail.html",
        "src/main/routers/sessions.py"
      ],
      "notes": "UAT complete. 5 bugs found: 1 Critical (setup save data loss), 4 Major (setup not loaded, analysis links broken, no confirm button, no stint display)."
    },
    {
      "id": "uat-030",
      "name": "UAT: Vehicles page",
      "category": "uat",
      "description": "Run /uat vehicles — trace every interaction on the vehicle config editor. Interactions: vehicle list/selector with active indicator, 'Set Active' button (PUT /api/vehicles/active), G-force limit fields (lateral, braking, power-limited accel), physical properties (weight, tire circumference, final drive), engine specs (redline, max power), transmission ratio fields (1st-6th), save button (PUT /api/vehicles/{id}). Check: does save actually send all fields? Are field values loaded from the correct vehicle? Does switching active vehicle update the indicator? What validation prevents bad input (negative weight, 0 ratios)? Fix any bugs found.",
      "status": "passing",
      "priority": 69,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/vehicles.html",
        "src/main/routers/vehicles.py",
        "src/config/vehicles.py"
      ],
      "notes": "UAT complete. 1 Major: alternative_setups lost on save (not included in payload, defaults to empty on backend). 4 Major: no backend validation for zero/negative ratios, final_drive, weight, circumference. 5 Minor issues."
    },
    {
      "id": "uat-040",
      "name": "UAT: Dashboard page",
      "category": "uat",
      "description": "Run /uat dashboard — trace the home page. Interactions: stats cards (total sessions, recent analyses, active vehicle, etc.), navigation links, any quick-action buttons, page load data fetching. Check: are stats fetched from real APIs or hardcoded? Do navigation links go to the right pages? What shows when there are 0 sessions? Fix any bugs found.",
      "status": "passing",
      "priority": 70,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/dashboard.html",
        "src/main/app.py"
      ],
      "notes": "UAT complete. 2 Critical: processFile() uses event.target but event not passed via onclick (crashes on click), same bug in modal. 1 Major: auto-refresh fetches stats but never renders to DOM. 3 Minor issues."
    },
    {
      "id": "uat-041",
      "name": "UAT: Parquet data viewer",
      "category": "uat",
      "description": "Run /uat parquet — trace the data viewer page. Interactions: file list/selector, data table with pagination (limit/offset via /api/parquet/view), channel stats display (min/max/mean from /api/parquet/summary), column sorting, row count display. Check: does pagination actually pass offset/limit params? Does file selection load the correct data? What happens with a very large file (10k+ rows)? Is the table rendered efficiently? Fix any bugs found.",
      "status": "passing",
      "priority": 71,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/parquet.html",
        "src/main/routers/parquet.py"
      ],
      "notes": "UAT complete. Found 5 bugs: 1 critical (time column shows interpolated values, not real index), 4 major (no response.ok check, XSS via filename in onclick, no loading indicator, list endpoint loads all files into memory). Also found 3 minor issues (indexOf O(n^2), no pagination disabled state, unused column_stats)."
    },
    {
      "id": "uat-042",
      "name": "UAT: Queue page",
      "category": "uat",
      "description": "Run /uat queue — trace the extraction job queue page. Interactions: stats cards (pending/processing/completed counts from /api/queue/stats), job list with status filters, retry button per job, delete button per job, auto-refresh polling (if any setInterval). Check: do retry/delete buttons call the correct API? Does the job list update after retry? Is auto-refresh implemented and does it avoid stacking requests? What happens when queue is empty? Fix any bugs found.",
      "status": "passing",
      "priority": 72,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/queue.html",
        "src/main/routers/queue.py"
      ],
      "notes": "UAT complete. 1 Critical: no response.ok check in job list loading (JSON parse fails on errors). 4 Major: modal state race condition (currentJobId stale), no request abort for auto-refresh, modal close doesn't clear currentJobId, job detail 404 not handled. 4 Minor issues."
    },
    {
      "id": "uat-043",
      "name": "UAT: Files page",
      "category": "uat",
      "description": "Run /uat files — trace the file browser page. Interactions: file list display, file size/date columns, click-to-view or click-to-analyze actions, any upload link. Check: is the file list fetched from an API or built server-side? Do action links navigate correctly? What happens when data directory is empty? Fix any bugs found.",
      "status": "passing",
      "priority": 73,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/files.html",
        "src/main/app.py"
      ],
      "notes": "UAT complete. 0 Critical. 1 Major: Process All Pending uses fragile DOM query (CSS class dependent). 4 Minor: modal button searches by text, export hardcodes fields, full page reload for updates."
    },
    {
      "id": "uat-044",
      "name": "UAT: Upload page",
      "category": "uat",
      "description": "Run /uat upload — trace the XRK file upload page. Interactions: file input or drag-and-drop zone, upload button, progress indicator, success/error feedback, redirect after upload. Check: does the form POST to the correct endpoint? Is file validation present (extension check, size limit)? What feedback does the user get during upload? What happens on server error? Fix any bugs found.",
      "status": "passing",
      "priority": 74,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/upload.html",
        "src/main/app.py"
      ],
      "notes": "UAT complete. 2 Critical: JSON parse crash when server returns non-JSON error (500 HTML page), no content-type check before parsing. 3 Major: no network error handling/timeout, no abort mechanism during upload, error response assumes 'detail' field. 8 Minor issues."
    },
    {
      "id": "uat-050",
      "name": "UAT Flow: Session selection + context persistence",
      "category": "uat",
      "description": "Run /uat session-selection — trace the cross-page session context flow. This flow spans multiple pages: (1) Select session on analysis page via session selector component, (2) Verify context is set via POST /api/context/set, (3) Navigate to gg-diagram — verify same session is loaded via GET /api/context/current, (4) Navigate to corner-analysis — verify again, (5) Clear context and verify all pages handle it gracefully. Trace session_selector.js lifecycle: loadSessions(), loadCurrentContext(), setContext(), scope indicator rendering. Check: is context stored server-side or client-side? What happens if context API fails? Fix any bugs found.",
      "status": "passing",
      "priority": 75,
      "depends_on": [],
      "tests": [],
      "files": [
        "static/js/session_selector.js",
        "src/main/routers/context.py",
        "templates/analysis.html",
        "templates/gg_diagram.html",
        "templates/corner_analysis.html"
      ],
      "notes": "UAT complete. 1 Critical: empty session_ids crashes set_scope() with IndexError. 2 Major: race condition if DOMContentLoaded fires after page ready (_initPromise undefined), context not validated against session existence (deleted sessions cause 404 loop). 4 Minor issues. Context persistence across pages WORKS correctly."
    },
    {
      "id": "uat-051",
      "name": "UAT Flow: Audit mode toggle + trace propagation",
      "category": "uat",
      "description": "Run /uat audit-mode — trace the audit mode flow across all 3 pages that support it. (1) Toggle audit mode ON on analysis page, (2) Verify all API calls append ?trace=true, (3) Verify audit panel renders with sanity checks (color-coded pass/warn/fail), (4) Verify trace data shows inputs/config/intermediates, (5) Verify impact descriptions are present, (6) Toggle OFF and verify trace param removed, (7) Navigate to gg-diagram — verify audit state persists (localStorage), (8) Repeat on corner-analysis. Check: does AuditManager.traceParam() correctly append '?' vs '&'? Are all display functions calling renderAuditPanels? What happens if trace data is missing from response? Fix any bugs found.",
      "status": "passing",
      "priority": 76,
      "depends_on": [],
      "tests": [],
      "files": [
        "static/js/audit.js",
        "static/css/audit.css",
        "templates/analysis.html",
        "templates/gg_diagram.html",
        "templates/corner_analysis.html",
        "src/main/routers/analysis.py",
        "src/main/routers/visualization.py"
      ],
      "notes": "UAT complete. ALL 10 test scenarios PASSED. Audit mode is solid and production-ready. 1 Minor: lap comparison endpoint missing trace parameter (consistency issue only). Toggle, localStorage persistence, trace propagation, panel rendering, impact descriptions all work correctly across all 3 pages."
    },
    {
      "id": "uat-052",
      "name": "UAT Flow: Vehicle switching + analysis refresh",
      "category": "uat",
      "description": "Run /uat vehicle-switching — trace the vehicle switching flow end-to-end. (1) On vehicles page, select different vehicle and click 'Set Active', (2) Verify PUT /api/vehicles/active is called, (3) Navigate to analysis page, run analysis, (4) Verify analysis uses new vehicle's config (mass, gear ratios, G limits), (5) Check: does the session selector show the active vehicle? Does the analysis response reflect the switched config? (6) Switch back and re-run — verify results change. Check: is vehicle state server-side only or also cached client-side? Could stale vehicle config produce wrong results? Fix any bugs found.",
      "status": "passing",
      "priority": 77,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/vehicles.html",
        "src/main/routers/vehicles.py",
        "src/config/vehicles.py",
        "templates/analysis.html",
        "src/main/routers/analysis.py"
      ],
      "notes": "UAT complete. 2 Critical: vehicles.py router creates new VehicleDatabase() instances (lines 17, 59) instead of using singleton — vehicle updates don't propagate to analyzers. 1 Major: session selector doesn't show which vehicle is active. 3 Minor issues. Core flow works when singleton is used correctly."
    },
    {
      "id": "uat-053",
      "name": "UAT Flow: Lap comparison + delta map",
      "category": "uat",
      "description": "Run /uat lap-comparison — trace the lap comparison flow on the analysis page. (1) Run lap analysis, (2) Select two laps for comparison from the lap table/dropdowns, (3) Verify /api/analyze/laps/compare/{filename}?lap_a=X&lap_b=Y is called with correct params, (4) Verify /api/track-map/delta/{filename} is called for the delta map SVG, (5) Verify comparison results render (segment bars, delta time, speed traces), (6) Verify delta map SVG renders with green/red coloring. Check: what if both laps are the same? What if a lap has incomplete GPS? Are lap numbers 0-indexed or 1-indexed in the API vs UI? Fix any bugs found.",
      "status": "passing",
      "priority": 78,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/analysis.html",
        "src/main/routers/analysis.py",
        "src/main/routers/visualization.py",
        "src/visualization/track_map.py"
      ],
      "notes": "UAT complete. Found 2 bugs: 1 critical (delta track map colors inverted — green/red meaning swapped between SVG rendering and UI/docstring labels), 1 major (segment time calculation uses np.diff on masked arrays losing last-point accuracy). Lap numbers are 1-indexed throughout (consistent). Same-lap comparison not validated but UI prevents it via unique checkboxes."
    },
    {
      "id": "uat-054",
      "name": "UAT Flow: Full import-to-analysis workflow",
      "category": "uat",
      "description": "Run /uat import-flow — trace the complete user workflow from upload to analysis. (1) Upload page: submit XRK file, (2) Queue page: verify job appears with correct status, (3) Files page: verify parquet appears after extraction, (4) Session import: fill metadata form and submit POST /api/v2/sessions/import, (5) Sessions page: verify new session appears in list, (6) Set as analysis context, (7) Analysis page: run full report. This is the end-to-end golden path. Check: are there any gaps where the user has to guess what to do next? Is navigation between steps clear? Fix any bugs found.",
      "status": "passing",
      "priority": 79,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/upload.html",
        "templates/queue.html",
        "templates/files.html",
        "templates/session_import.html",
        "templates/sessions.html",
        "templates/analysis.html"
      ],
      "notes": "UAT complete. 1 Critical: no navigation from Files page to Sessions Import (dead end after processing). 1 Major: sessions list clicking doesn't auto-set analysis context. Upload→Queue→Files flow works. Session Import wizard works. Gap is connecting Files→Import and Sessions→Analysis context."
    },
    {
      "id": "uat-060",
      "name": "UAT: Base template + navigation",
      "category": "uat",
      "description": "Run /uat on templates/base.html — trace the shared shell that wraps every page. Interactions: navbar links (Home, Upload, Files, Data Viewer, Sessions, Analysis, G-G Diagram, Corners, Queue, Vehicles), active link highlighting, showAlert() toast notifications, apiCall() shared fetch wrapper (error handling, JSON parsing), dark theme CSS variables, mobile responsive hamburger menu, feedback widget script tag, audit CSS/JS includes. Check: do all nav links point to valid routes? Does showAlert() handle all severity levels? Does apiCall() properly throw on non-OK responses? Is the feedback widget script tag correct? Fix any bugs found.",
      "status": "passing",
      "priority": 80,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/base.html",
        "src/main/app.py",
        "static/js/audit.js",
        "static/css/audit.css"
      ],
      "notes": "UAT complete. 3 Critical: apiCall() crashes parsing non-JSON error responses, feedback widget URL hardcoded to http://localhost:8100 (mixed content on HTTPS). 1 Major: no active link highlighting on navbar. All 10 navbar links valid. showAlert(), formatLapTime(), audit includes all work correctly."
    },
    {
      "id": "uat-061",
      "name": "UAT: Error page + HTTP error handling",
      "category": "uat",
      "description": "Run /uat on the error handling layer. Trace: (1) templates/error.html — what does it display? (2) FastAPI exception handlers in app.py — HTTPException, RequestValidationError, generic 500. (3) All router endpoints that return 400/404/422 — are error messages user-friendly or raw stack traces? (4) Frontend apiCall() — does it display errors via showAlert()? Check: is there a consistent error UX across all pages? Do API errors include actionable messages? What happens on an unhandled server exception? Fix any bugs found.",
      "status": "passing",
      "priority": 81,
      "depends_on": [],
      "tests": [],
      "files": [
        "templates/error.html",
        "src/main/app.py",
        "src/main/deps.py"
      ],
      "notes": "UAT complete. 2 Critical: DEBUG mode leaks stack traces in API responses (app.py:348-349), raw exception text in parquet list response. 3 Major: missing HTTPException/RequestValidationError handlers (returns JSON not error.html), silent exception swallowing in parquet uploads dir. Most pages use showAlert() consistently."
    },
    {
      "id": "bug-analysis-001",
      "name": "Fix undefined `filename` variable in runAnalysis()",
      "category": "bugfix",
      "description": "analysis.html:449 uses `filename` variable which does not exist after arch-007 migration (file dropdown removed, replaced by session selector). Should use `currentFile` which is set at line 435 from `currentParquetPath`. Same bug at line 460 in loadTrackMap call. ALL analysis types are broken — fetch URL becomes /api/analyze/{type}/undefined → 404.",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "templates/analysis.html"
      ],
      "notes": "Found during UAT of analysis. Severity: Critical",
      "source_uat": "analysis"
    },
    {
      "id": "bug-analysis-002",
      "name": "Fix onContextChange callback overwritten by session_selector.html",
      "category": "bugfix",
      "description": "session_selector.html:79 DOMContentLoaded handler overwrites onContextChange callback with console.log after analysis.html:382 sets it to loadSessionForAnalysis. Due to async race: analysis.html handler runs synchronously and sets callback, then session_selector.html handler resumes from await init() and overwrites it. Fix: remove generic onContextChange from session_selector.html, let consuming pages set their own callbacks. Affects all 3 pages that include session_selector.html (analysis, gg-diagram, corner-analysis).",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "templates/components/session_selector.html",
        "templates/analysis.html",
        "templates/gg_diagram.html",
        "templates/corner_analysis.html"
      ],
      "notes": "Found during UAT of analysis. Severity: Critical. Root cause shared across 3 pages.",
      "source_uat": "analysis"
    },
    {
      "id": "bug-analysis-003",
      "name": "Fix DOMContentLoaded race condition with session selector init",
      "category": "bugfix",
      "description": "analysis.html:387 reads window._sessionSelector.currentContext before _sessionSelector.init() has completed (async race). Context is always null on initial page load, causing buttons to be disabled even when a valid context exists server-side. Fix: analysis.html should await init() completion before checking context, or use a ready promise/callback pattern. Also affects gg-diagram and corner-analysis pages.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/analysis.html",
        "templates/components/session_selector.html",
        "templates/gg_diagram.html",
        "templates/corner_analysis.html"
      ],
      "notes": "Found during UAT of analysis. Severity: Major. Related to bug-analysis-002 — same async race root cause.",
      "source_uat": "analysis"
    },
    {
      "id": "bug-gg-001",
      "name": "Fix 5 stale `file-select` references in gg_diagram.html",
      "category": "bugfix",
      "description": "gg_diagram.html has 5 references to document.getElementById('file-select').value at lines 1668, 1675, 1714, 1899, 1925. The file dropdown was removed by arch-007 (replaced by session selector). Should use `currentParquetPath`. Affects: updateColorScheme() (color-by dropdown broken), filterByLap() (lap filter broken), compareLaps() (lap comparison broken), populateSessionList() (session comparison list broken), compareSessions() (session comparison broken). ALL interactive features beyond initial load are broken.",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "templates/gg_diagram.html"
      ],
      "notes": "Fixed: all 5 file-select refs → currentParquetPath",
      "source_uat": "gg-diagram"
    },
    {
      "id": "bug-gg-002",
      "name": "Remove empty control-panel div in gg_diagram.html",
      "category": "bugfix",
      "description": "gg_diagram.html lines 297-299 have an empty <div class='control-panel'> inside a col-md-6 — leftover from file dropdown removal. Causes an empty column in the controls row.",
      "status": "passing",
      "priority": 50,
      "tests": [],
      "files": [
        "templates/gg_diagram.html"
      ],
      "notes": "Fixed: removed empty control-panel div and col-md-6 wrapper",
      "source_uat": "gg-diagram"
    },
    {
      "id": "bug-corner-001",
      "name": "Fix stale `file-select` reference in corner_analysis.html renderTrackMap()",
      "category": "bugfix",
      "description": "corner_analysis.html line 845: renderTrackMap() uses document.getElementById('file-select').value which doesn't exist after arch-007. Should use `currentParquetPath`. Track map view mode is completely broken — returns undefined filename, API call fails.",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "templates/corner_analysis.html"
      ],
      "notes": "Fixed: file-select ref → currentParquetPath",
      "source_uat": "corner-analysis"
    },
    {
      "id": "bug-lapcomparison-001",
      "name": "Delta track map colors inverted: green/red meaning swapped vs UI labels and docstrings",
      "category": "bugfix",
      "description": "The delta track map SVG renders Red where Lap A (reference) is faster and Green where Lap B (comparison) is faster. But the UI label in analysis.html line 314 says 'Green = Lap A faster, Red = Lap B faster' — the exact opposite. The visualization.py docstring (lines 42-45) also says 'Green sections = lap_a faster' which contradicts the actual rendering. Root cause: track_map.py line 645 negates the segment time_delta before mapping to a Red→Yellow→Green color scale. The comment says 'we want green when ref is faster, so we negate' but the negation actually maps ref-faster to negative values which land on the Red end of the scale. The SVG's own legend (track_map.py lines 726-727) is internally consistent with the rendering (Red = ref faster) but contradicts the HTML and docstrings. Fix: remove the negation at line 645 so positive delta (ref faster) maps to Green, matching all labels, comments, and docstrings.",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "src/visualization/track_map.py",
        "templates/analysis.html",
        "src/main/routers/visualization.py"
      ],
      "notes": "Found during UAT of lap-comparison. Severity: Critical. User sees opposite color coding from what the label describes — a driver reviewing data would draw wrong conclusions about which track sections need improvement.",
      "source_uat": "lap-comparison"
    },
    {
      "id": "bug-lapcomparison-002",
      "name": "Segment time calculation loses accuracy via np.diff on masked+truncated arrays",
      "category": "bugfix",
      "description": "In compare_laps_detailed() at lap_analysis.py lines 986-987, segment time is calculated as np.sum(np.diff(time_a[:-1][mask_a[:-1]])). Two issues: (1) time_a[:-1] and mask_a[:-1] unconditionally drop the last data point, so the last segment (90-100%) systematically undercounts time by one sample interval (~0.1s at 10Hz). (2) np.diff on a boolean-masked array can produce incorrect diffs if the mask selects non-contiguous indices (unlikely for distance-based segments but possible at segment boundaries). The correct approach: find first and last indices where mask is True, then compute time_a[last_idx] - time_a[first_idx]. This would be more accurate and handle edge cases (single-point segments return 0 instead of crashing).",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "src/features/lap_analysis.py"
      ],
      "notes": "Found during UAT of lap-comparison. Severity: Major. Affects accuracy of per-segment time deltas in both the comparison panel segment bars and the delta track map coloring intensity. At 10Hz the error is ~0.1s per segment worst case, which could flip a 'faster'/'slower' determination for close segments.",
      "source_uat": "lap-comparison"
    },
    {
      "id": "bug-parquet-001",
      "name": "Time column shows interpolated values instead of actual parquet index",
      "category": "bugfix",
      "description": "parquet.html:237 interpolates time from index_range[0..1]/total_rows instead of using actual df.index values. The view endpoint (parquet.py:89) uses to_dict(orient='records') which discards the index. For non-uniform sampling or data with gaps, displayed time values are wrong. Fix: include actual index values in the response (e.g., add 'timestamps' array or include index in each record).",
      "status": "passing",
      "priority": 5,
      "tests": [],
      "files": [
        "templates/parquet.html",
        "src/main/routers/parquet.py"
      ],
      "notes": "Found during UAT of parquet. Severity: Critical. Data viewer showing wrong timestamps defeats the purpose of a data inspection tool.",
      "source_uat": "parquet"
    },
    {
      "id": "bug-parquet-002",
      "name": "No response.ok check in loadFileList — server errors produce confusing TypeError",
      "category": "bugfix",
      "description": "parquet.html:103-108: loadFileList() calls fetch('/api/parquet/list') but never checks response.ok. On 500 errors, response.json() may parse the error response, then data.parquet_files is undefined, causing TypeError 'Cannot read properties of undefined (reading length)' which hides the real error message. Same pattern in loadFile() at line 149 and loadData() at line 217 — none check response.ok before accessing response keys.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/parquet.html"
      ],
      "notes": "Found during UAT of parquet. Severity: Major. All 3 fetch calls in the page lack response.ok checks.",
      "source_uat": "parquet"
    },
    {
      "id": "bug-parquet-003",
      "name": "XSS via unescaped file.path in onclick handler string literal",
      "category": "bugfix",
      "description": "parquet.html:120: file.path from API response is interpolated directly into an onclick attribute string: onclick=\"loadFile('${file.path}')\". A filename containing a single quote (e.g., test'file.parquet) breaks the JS string literal. A crafted filename could execute arbitrary JS. Same risk for file.filename (line 124), file.source (line 124), file.error (line 116). Fix: use data attributes or event delegation instead of inline onclick with string interpolation.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/parquet.html"
      ],
      "notes": "Found during UAT of parquet. Severity: Major. Low practical risk (filenames come from filesystem) but still a code quality issue.",
      "source_uat": "parquet"
    },
    {
      "id": "bug-parquet-004",
      "name": "No loading indicator when selecting a file — two sequential fetches with no feedback",
      "category": "bugfix",
      "description": "parquet.html:143-211: loadFile() makes two sequential fetch calls (summary then view) with no visual feedback. For large files, the user clicks a file and nothing visibly happens for seconds. The clicked file item has no active/loading state. Fix: add a loading spinner or 'Loading...' state to the summary and data sections immediately on click, disable the file list during load.",
      "status": "passing",
      "priority": 15,
      "tests": [],
      "files": [
        "templates/parquet.html"
      ],
      "notes": "Found during UAT of parquet. Severity: Major. UX issue — user has no feedback that their click registered.",
      "source_uat": "parquet"
    },
    {
      "id": "bug-parquet-005",
      "name": "List endpoint loads every parquet file fully into memory just to count rows",
      "category": "bugfix",
      "description": "parquet.py:29 and :51: list_parquet_files() calls pd.read_parquet(pq_file) for every file in the directory just to get len(df) and len(df.columns). Should use pyarrow.parquet.read_metadata() or pd.read_parquet(pq_file, columns=[]) for lightweight metadata access. Also, view_parquet_file() (line 83) and parquet_summary() (line 133) each load the entire file — a single file selection triggers 2 full loads after the list already loaded it. Combined with being async endpoints blocking on synchronous pd.read_parquet, this blocks the event loop.",
      "status": "passing",
      "priority": 20,
      "tests": [],
      "files": [
        "src/main/routers/parquet.py"
      ],
      "notes": "Found during UAT of parquet. Severity: Major. Performance — with hi-res suspension files (500Hz, 300k rows), list endpoint could take 10+ seconds and block all other requests.",
      "source_uat": "parquet"
    },
    {
      "id": "bug-sessiondetail-001",
      "name": "Fix saveSetup() payload mismatch — setup data silently discarded",
      "category": "bugfix",
      "description": "session_detail.html:316 saveSetup() sends flat top-level keys {tire_pressures, fuel_level, temperature, weather, notes} but sessions.py:277 reads data.get('setup_data', {}) which is never present in the payload. Result: PUT /api/v2/sessions/{id}/setup returns 200 OK but stores empty setup_data={}. All tire pressures, fuel, temperature, and weather data silently lost. Fix: either wrap frontend payload in setup_data key, or change backend to read top-level keys.",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "templates/session_detail.html",
        "src/main/routers/sessions.py"
      ],
      "notes": "Found during UAT of session-detail. Severity: Critical. Data loss bug — user thinks save succeeded.",
      "source_uat": "session-detail"
    },
    {
      "id": "bug-sessiondetail-002",
      "name": "Setup form never loads existing data on page load",
      "category": "bugfix",
      "description": "session_detail.html setup form fields (tire pressures, fuel, temperature, weather, notes) are always empty on page load. GET /api/v2/sessions/{id}/setup endpoint exists at sessions.py:254 but is never called. Previously saved setup data is invisible — user has no way to see or edit existing setup. Fix: add loadSetup() function that calls the API on page load and populates form fields.",
      "status": "passing",
      "priority": 2,
      "tests": [],
      "files": [
        "templates/session_detail.html"
      ],
      "notes": "Found during UAT of session-detail. Severity: Major. Setup data exists in DB but user cannot see it.",
      "source_uat": "session-detail"
    },
    {
      "id": "bug-sessiondetail-003",
      "name": "Analysis tool links pass ignored ?file= query params",
      "category": "bugfix",
      "description": "session_detail.html:189,197,208 analysis links pass ?file={{session.parquet_path}} to /parquet, /gg-diagram, and /corner-analysis. None of these pages read URL query params — GG diagram and corner analysis use session selector context system, parquet viewer loads its own file list. The ?file= param is silently ignored, so clicking 'G-G Diagram' from session detail does NOT load that session's data. Fix: either set session context before navigating (POST /api/context/set then redirect), or add ?file= reading to target pages.",
      "status": "passing",
      "priority": 3,
      "tests": [],
      "files": [
        "templates/session_detail.html"
      ],
      "notes": "Found during UAT of session-detail. Severity: Major. Navigation appears to work but loads wrong/no data.",
      "source_uat": "session-detail"
    },
    {
      "id": "bug-sessiondetail-004",
      "name": "No confirm session button on detail page",
      "category": "bugfix",
      "description": "session_detail.html has no UI element to confirm a pending session. Backend endpoint PUT /api/v2/sessions/{id}/confirm exists at sessions.py:192 with full metadata update support, but the detail page only shows a 'Pending' badge (line 42) with no way to change it. Users cannot confirm sessions from the detail view. Fix: add 'Confirm Session' button visible when import_status=='pending', calling the confirm endpoint.",
      "status": "passing",
      "priority": 4,
      "tests": [],
      "files": [
        "templates/session_detail.html"
      ],
      "notes": "Found during UAT of session-detail. Severity: Major. Core workflow gap — pending sessions stuck in limbo.",
      "source_uat": "session-detail"
    },
    {
      "id": "bug-sessiondetail-005",
      "name": "No stint breakdown displayed on detail page",
      "category": "bugfix",
      "description": "session_detail.html has no stint section. Backend GET /api/v2/sessions/{id} at sessions.py:119 returns stints array (db.get_stints), but the detail page never calls this endpoint and has no stint UI. The page only calls /api/v2/sessions/{id}/laps. Fix: add stint breakdown section showing stint number, lap range, best/avg lap times. Could be a collapsible card between session info and lap table.",
      "status": "passing",
      "priority": 5,
      "tests": [],
      "files": [
        "templates/session_detail.html"
      ],
      "notes": "Found during UAT of session-detail. Severity: Major. Stint data available but hidden from user.",
      "source_uat": "session-detail"
    },
    {
      "id": "bug-sessions-001",
      "name": "Sessions table vehicle column shows N/A — API returns vehicle_id not vehicle_name",
      "category": "bugfix",
      "description": "sessions.html:171 uses session.vehicle_name but Session.to_dict() (models.py:82) only returns vehicle_id. Vehicle column always shows 'N/A'. Need to either join vehicle name in API response or look up from VehicleDatabase.",
      "status": "passing",
      "priority": 3,
      "tests": [],
      "files": [
        "templates/sessions.html",
        "src/session/models.py"
      ],
      "notes": "Found during UAT of sessions page. Severity: Critical.",
      "source_uat": "sessions"
    },
    {
      "id": "bug-sessions-002",
      "name": "Sessions status filter broken — JS checks 'status' but API returns 'import_status'",
      "category": "bugfix",
      "description": "sessions.html:136 filters by session.status but Session.to_dict() returns import_status field. Filter has no effect. Fix: change JS to check session.import_status.",
      "status": "passing",
      "priority": 2,
      "tests": [],
      "files": [
        "templates/sessions.html"
      ],
      "notes": "Found during UAT of sessions page. Severity: Critical.",
      "source_uat": "sessions"
    },
    {
      "id": "bug-dashboard-001",
      "name": "processFile() crashes — event.target undefined (event not passed via onclick)",
      "category": "bugfix",
      "description": "dashboard.html:174 uses event.target but function called via onclick='processFile(filename)' without passing event. TypeError on every click. Same bug in modal button (line 251). Fix: pass event parameter or use different button reference strategy.",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "templates/dashboard.html"
      ],
      "notes": "Found during UAT of dashboard. Severity: Critical. Process File button completely broken.",
      "source_uat": "dashboard"
    },
    {
      "id": "bug-vehiclerouter-001",
      "name": "Vehicle router creates new VehicleDatabase() instead of using singleton",
      "category": "bugfix",
      "description": "vehicles.py:17 and :59 create new VehicleDatabase() instances instead of calling get_vehicle_database(). Updates via PUT don't propagate to the singleton used by analyzers. After editing vehicle config and running analysis, old config values are used. Fix: replace VehicleDatabase() with get_vehicle_database().",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "src/main/routers/vehicles.py"
      ],
      "notes": "Found during UAT of vehicle-switching flow. Severity: Critical. Vehicle config edits silently ignored by analysis.",
      "source_uat": "vehicle-switching"
    },
    {
      "id": "bug-import-001",
      "name": "ImportResult missing total_duration and sample_count — Step 2 review incomplete",
      "category": "bugfix",
      "description": "session_import.html:467,472 expects response.total_duration and response.sample_count but ImportResult (importer.py:36-51) doesn't define these fields. Step 2 review can't show session duration or sample count. Fix: add fields to ImportResult dataclass and populate in import flow.",
      "status": "passing",
      "priority": 3,
      "tests": [],
      "files": [
        "src/session/importer.py",
        "templates/session_import.html"
      ],
      "notes": "Found during UAT of session-import. Severity: Critical.",
      "source_uat": "session-import"
    },
    {
      "id": "bug-base-001",
      "name": "apiCall() crashes parsing non-JSON error responses",
      "category": "bugfix",
      "description": "base.html:335 calls response.json() on error responses without checking Content-Type. If server returns HTML (e.g., 502 proxy error, 500 with traceback), JSON.parse throws SyntaxError. The error is swallowed, showing opaque message. Fix: wrap error JSON parse in try/catch, fall back to response.text().",
      "status": "passing",
      "priority": 2,
      "tests": [],
      "files": [
        "templates/base.html"
      ],
      "notes": "Found during UAT of base template. Severity: Critical. Affects ALL pages using apiCall().",
      "source_uat": "base-template"
    },
    {
      "id": "bug-vehicles-002",
      "name": "alternative_setups silently lost on vehicle save",
      "category": "bugfix",
      "description": "vehicles.html:398-419 saveVehicle() doesn't include alternative_setups in payload. Backend Vehicle.from_dict() defaults to empty list. On save, all alternative transmission setups are deleted. Fix: include selectedVehicle.alternative_setups in the save payload.",
      "status": "passing",
      "priority": 2,
      "tests": [],
      "files": [
        "templates/vehicles.html"
      ],
      "notes": "Found during UAT of vehicles page. Severity: Major. Data loss.",
      "source_uat": "vehicles"
    },
    {
      "id": "bug-error-001",
      "name": "Debug mode leaks stack traces in API responses",
      "category": "bugfix",
      "description": "app.py:348-349 appends traceback.format_exc() to error_detail when DEBUG=True. Full stack traces sent to client, exposing file paths, library versions, internal code. Should log to stderr only, never in response. Fix: log traceback server-side, return sanitized message to client.",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "src/main/app.py"
      ],
      "notes": "Found during UAT of error handling. Severity: Critical. Security issue.",
      "source_uat": "error-handling"
    },
    {
      "id": "bug-analysis-004",
      "name": "Gear analysis display completely broken — field name and structure mismatches",
      "category": "bugfix",
      "description": "Frontend displayGearAnalysis() at analysis.html:L843-L930 reads data.gears_used, data.most_used_gear, data.avg_gear, data.total_time_seconds, and treats data.gear_usage as a dict. Backend GearAnalysisReport.to_dict() returns gear_usage as a list, uses total_duration_seconds, nests summary fields. Result: most metrics show N/A or NaN, gear table shows array indices instead of gear numbers.",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "templates/analysis.html",
        "src/features/gear_analysis.py"
      ],
      "notes": "Fixed: reads summary.gears_used/most_used_gear/total_shifts, total_duration_seconds, iterates gear_usage as list, uses rpm_range.avg and usage_percent",
      "source_uat": "analysis"
    },
    {
      "id": "bug-analysis-005",
      "name": "Power analysis display completely broken — field name and structure mismatches",
      "category": "bugfix",
      "description": "Frontend displayPowerAnalysis() at analysis.html:L932-L1013 reads flat top-level fields (data.max_power_hp, data.max_acceleration_g, etc.) but backend nests them under data.power.max_hp, data.acceleration.max_g, data.braking.max_g. Events array has different field names (start_time vs time, peak_g vs g_force). Result: all metric boxes show N/A, events table empty.",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "templates/analysis.html",
        "src/features/power_analysis.py"
      ],
      "notes": "Fixed: reads power.max_hp/avg_hp, acceleration.max_g/events_count/events, braking.max_g/events_count/events, event fields start_time/peak_g/duration_s, power.at_peak_rpm_hp",
      "source_uat": "analysis"
    },
    {
      "id": "bug-parquet-006",
      "name": "loadFile crashes — innerHTML destroys channel-stats DOM element",
      "category": "bugfix",
      "description": "loadFile() at parquet.html:158 replaces summary-section innerHTML, destroying tbody#channel-stats. At line 170, only partial structure is rebuilt (stat cards) without the channel overview table. Line 218 calls getElementById('channel-stats').innerHTML on null, throwing TypeError. Catch block shows alert and returns, preventing loadData() from being called. Page is completely non-functional for viewing any parquet file data.",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "templates/parquet.html"
      ],
      "notes": "Fixed: loading indicator now updates only summary-stats and channel-stats content instead of replacing summary-section innerHTML. Preserves DOM structure so channel-stats always exists.",
      "source_uat": "parquet"
    },
    {
      "id": "bug-trackmap-001",
      "name": "No page route for /track-map — returns 404",
      "category": "bugfix",
      "description": "track_map.html template exists but no @app.get('/track-map') route is defined in app.py. Navigating to /track-map returns 404. The template expects server-side context variables (svg_content, laps, stats) that nothing provides. Fix: add a page route in app.py.",
      "status": "passing",
      "priority": 1,
      "tests": [],
      "files": [
        "templates/track_map.html",
        "src/main/app.py"
      ],
      "notes": "Fixed: added @app.get('/track-map') route with empty defaults for svg_content, laps, stats. Template handles defaults via Jinja2 | default() filters.",
      "source_uat": "track-map"
    },
    {
      "id": "bug-trackmap-002",
      "name": "No navigation link to track-map in navbar",
      "category": "bugfix",
      "description": "base.html navbar (lines 233-263) lists all other pages but omits Track Map. Even once the route is added, users cannot discover the page through navigation. Fix: add nav-item for /track-map.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/base.html"
      ],
      "notes": "Fixed: added Track Map nav link between Corners and Queue in base.html navbar",
      "source_uat": "track-map"
    },
    {
      "id": "bug-trackmap-003",
      "name": "track_map.html does not extend base.html — standalone HTML",
      "category": "bugfix",
      "description": "Template is standalone HTML with inline CSS, no navbar, no footer, no Bootstrap, no shared JS (audit.js, session_selector.js). Visually inconsistent with all other pages. Fix: rewrite to extend base.html.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/track_map.html",
        "templates/base.html"
      ],
      "notes": "Fixed: rewrote track_map.html to extend base.html with session selector, Bootstrap, navbar, and client-side SVG fetching",
      "source_uat": "track-map"
    },
    {
      "id": "bug-trackmap-004",
      "name": "Color-by dropdown only updates legend, not SVG",
      "category": "bugfix",
      "description": "colorBy change handler (line 260-267) updates the HTML legend text/gradient but never re-fetches the SVG from the API. The map stays colored by the original scheme while the legend shows a different one. Fix: add fetch call to /api/track-map/{filename}?color_by={scheme} on change.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/track_map.html"
      ],
      "notes": "Fixed: color-by dropdown now calls reloadMap() which re-fetches SVG from API with new color_by param",
      "source_uat": "track-map"
    },
    {
      "id": "bug-trackmap-005",
      "name": "Lap selection dropdown is a no-op stub",
      "category": "bugfix",
      "description": "lapSelect change handler (line 270-273) only console.logs the selection. Comment says 'placeholder for API integration.' No filtering occurs. Fix: implement or remove the dropdown.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/track_map.html"
      ],
      "notes": "Fixed: removed no-op lap select dropdown. Page now uses session selector for session selection.",
      "source_uat": "track-map"
    },
    {
      "id": "bug-dashboard-002",
      "name": "Auto-refresh stats poller fetches data but never updates DOM",
      "category": "bugfix",
      "description": "setInterval at dashboard.html:283-291 calls GET /api/stats every 30 seconds but the callback does nothing with the response. Stat card DOM elements have no id attributes and no update logic. Wastes network resources with zero user benefit. Fix: either remove the interval or add DOM update logic.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/dashboard.html"
      ],
      "notes": "Fixed: removed useless setInterval that polled /api/stats every 30s without updating DOM",
      "source_uat": "dashboard"
    },
    {
      "id": "bug-files-001",
      "name": "Modal action buttons crash with TypeError on closest('tr')",
      "category": "bugfix",
      "description": "processFileFromModal() at line 435 and deleteFileFromModal() at line 446 iterate ALL button elements and call button.closest('tr').querySelector('strong').textContent without null-checking closest('tr'). Buttons outside table rows return null, causing TypeError. Both modal actions are non-functional. Fix: add null guard on closest('tr') result.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/files.html"
      ],
      "notes": "Fixed: added null guard on closest('tr') and optional chaining on querySelector('strong') in both modal functions",
      "source_uat": "files"
    },
    {
      "id": "bug-sessionimport-001",
      "name": "Vehicle dropdown active_vehicle_id key mismatch",
      "category": "bugfix",
      "description": "session_import.html:369 reads response.active_vehicle_id but GET /api/vehicles (vehicles.py:22) returns key active_vehicle. Causes activeVehicle to be undefined, preventing vehicle pre-selection and automatic setup loading. Fix: change to response.active_vehicle.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/session_import.html",
        "src/main/routers/vehicles.py"
      ],
      "notes": "Fixed: changed response.active_vehicle_id to response.active_vehicle to match API response key",
      "source_uat": "session-import"
    },
    {
      "id": "bug-sessionimport-002",
      "name": "Lap times missing from detection review table",
      "category": "bugfix",
      "description": "LapClassificationResult.to_dict() at models.py:332-339 does not include lap_time, but frontend reads lap.lap_time at session_import.html:484. All laps show N/A for their time in Step 2 review. Fix: enrich lap_classifications to include lap_time.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "src/session/importer.py",
        "src/session/models.py",
        "templates/session_import.html"
      ],
      "notes": "Fixed: added lap_time field to LapClassificationResult dataclass and to_dict(), populated from lap.lap_time in classifier",
      "source_uat": "session-import"
    },
    {
      "id": "bug-upload-001",
      "name": "uploadSingleFile error handler assumes JSON response",
      "category": "bugfix",
      "description": "In uploadSingleFile() at upload.html:L357-359, when server returns non-JSON error (HTML page, empty body), await response.json() throws unhandled secondary error. User sees confusing JSON parse error instead of actual server error. Fix: wrap response.json() in try/catch with fallback to HTTP status code.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/upload.html"
      ],
      "notes": "Fixed: wrapped response.json() in try/catch, falls back to HTTP status code for non-JSON errors",
      "source_uat": "upload"
    },
    {
      "id": "bug-lapcomparison-003",
      "name": "Stale comparison section persists on re-analysis",
      "category": "bugfix",
      "description": "runAnalysis() at analysis.html:432 hides lap-filter-section, lap-recommendations, track-map-section before new analysis, but does NOT hide lap-comparison-section. Old comparison from previous session/laps remains visible with stale data. Fix: add document.getElementById('lap-comparison-section').style.display = 'none' after line 450.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/analysis.html"
      ],
      "notes": "Fixed: added lap-comparison-section hide alongside other section hides before re-analysis",
      "source_uat": "lap-comparison"
    },
    {
      "id": "bug-sessiondetail-006",
      "name": "Stint total_time field does not exist in backend response",
      "category": "bugfix",
      "description": "session_detail.html:272 references stint.total_time but Stint.to_dict() in models.py:248-260 only has start_time and end_time. Total Time column in stints table always shows N/A. Fix: add computed total_time to Stint.to_dict() or compute in JS.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/session_detail.html",
        "src/session/models.py"
      ],
      "notes": "Fixed: added total_time computed field to Stint.to_dict() (end_time - start_time), plus JS fallback",
      "source_uat": "session-detail"
    },
    {
      "id": "bug-gg-003",
      "name": "Zone detail view uses fabricated reference data presented as real analysis",
      "category": "bugfix",
      "description": "getBestLapForZone() at line 2370 returns fabricated reference data using hardcoded improvementFactor=1.15. Entry speed formula (avg_total_g*25) has no physical basis, brake point hardcoded at 200/150 ft. All zone comparisons, recommendations, and zone G-G chart display fictitious numbers as 'Reference Lap' data without disclaimer. Fix: implement real best-lap lookup or add visible disclaimer.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/gg_diagram.html"
      ],
      "notes": "Fixed: added visible disclaimer ('Estimated targets, not from actual best lap data'), renamed chart label to 'Estimated Target', added TODO comment for real best-lap lookup",
      "source_uat": "gg-diagram"
    },
    {
      "id": "bug-gg-004",
      "name": "Biggest Opportunities click can leave user on blank page",
      "category": "bugfix",
      "description": "openZoneDetailFromOverview() at line 1021-1022 hides overview-section and deep-dive-view BEFORE checking if rankedIndex >= 0 at line 1019. If findIndex fails (returns -1 due to floating-point time comparison), zone-detail-view is never shown, leaving completely blank page. Fix: move hide calls inside the success branch.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/gg_diagram.html"
      ],
      "notes": "Already correct: hide calls are inside the if (rankedIndex >= 0) success branch in current code",
      "source_uat": "gg-diagram"
    },
    {
      "id": "bug-importflow-001",
      "name": "Session import file path with quotes breaks onclick handler",
      "category": "bugfix",
      "description": "At session_import.html:349, paths are interpolated into onclick using single-quote delimiters. If a file path contains a single quote, the JavaScript breaks, making the Import button non-functional for that file. Fix: escape quotes or use data attributes with addEventListener.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/session_import.html"
      ],
      "notes": "Fixed: escape single quotes in file path and filename before onclick interpolation",
      "source_uat": "import-flow"
    },
    {
      "id": "bug-vehicleswitching-001",
      "name": "Setup snapshot uses nonexistent get_vehicle() method",
      "category": "bugfix",
      "description": "sessions.py:237 calls vehicle_db.get_vehicle(session.vehicle_id) but VehicleDatabase only has get() method (vehicles.py:320). Raises AttributeError, silently caught at line 246, preventing setup snapshots from being captured. Fix: change to vehicle_db.get(session.vehicle_id).",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "src/main/routers/sessions.py",
        "src/config/vehicles.py"
      ],
      "notes": "Fixed: changed vehicle_db.get_vehicle() to vehicle_db.get() which is the actual VehicleDatabase method",
      "source_uat": "vehicle-switching"
    },
    {
      "id": "bug-corner-002",
      "name": "Context auto-load race condition on corner-analysis page load",
      "category": "bugfix",
      "description": "DOMContentLoaded handler in corner_analysis.html (L367-388) runs before session selector init. _initPromise is undefined and currentContext is null, so analysis never auto-loads for an already-selected session. Scope indicator shows session but page displays no results. Fix: set _initPromise synchronously or have init() call onContextChange when context loaded.",
      "status": "passing",
      "priority": 10,
      "tests": [],
      "files": [
        "templates/corner_analysis.html",
        "templates/components/session_selector.html"
      ],
      "notes": "Fixed: _initPromise now set synchronously via wrapping Promise in session_selector.html, ensuring it's always available for await",
      "source_uat": "corner-analysis"
    }
  ],
  "metadata": {
    "created_at": "2025-01-29T01:00:00Z",
    "last_updated": "2026-02-12T00:00:00Z",
    "total_features": 67,
    "passing": 66,
    "failing": 0,
    "planned": 1,
    "archive_file": "features-archive.json"
  },
  "categories": {
    "bugfix": "Bug fixes and corrections",
    "core": "Data extraction and processing pipeline",
    "analysis": "Telemetry analysis features",
    "ui": "Web interface and visualization",
    "infra": "Infrastructure and configuration",
    "testing": "Test coverage and quality",
    "cleanup": "Code quality improvements from docs/CLEANUP_AUDIT.md",
    "safeguard": "Calculation traceability and sanity checks from docs/SAFEGUARD_SYSTEM.md",
    "architecture": "Structural improvements per docs/PROCESS.md three-phase pipeline",
    "uat": "Code-trace user acceptance testing via /uat skill — trace UI interactions through full stack, find and fix bugs"
  }
}
